In [52]:
import pandas as pd

# Series

In [2]:
pd.Series( [1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
index_s = ['a', 'b', 'c', 'd','e']
ser = pd.Series( [1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
ser[0], ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_9032\1772165095.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [5]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
ser2 = pd.Series([10, 'banana'])
type(ser2), ser2

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [7]:
population = pd.Series([ 9776, 2729, 1566, 3158], 
                       index=['ì„œìš¸', 'ë¶€ì‚°', 'ì¸ì²œ', 'ëŒ€êµ¬'])
population['ì„œìš¸']
population[['ì„œìš¸', 'ë¶€ì‚°']] #0,1  íŒ¬ì‹œì¸ë±ì‹±

ì„œìš¸    9776
ë¶€ì‚°    2729
dtype: int64

In [8]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, ì„œìš¸ to ëŒ€êµ¬
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [9]:
#ser[0], ser['a']
ser.iloc[0], ser.loc['a']

(np.int64(1), np.int64(1))

# DataFrame

In [10]:
import pandas as pd  # ë°˜ë“œì‹œ ë¨¼ì €!

scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

```
iloc[] : indexlocator
loc[] : locator
```

In [11]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [12]:
scientists.index

RangeIndex(start=0, stop=2, step=1)

In [13]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [14]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [15]:
scientists.index = ['Rosaline Franklin', 'William Gosset']

In [16]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [17]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [18]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [19]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [20]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [21]:
sci1.loc[0,'Name'] #[row, col] ì¸ë±ì‹±

'Rosaline Franklin'

In [22]:
#ilocë¡œ william gossetì˜ age ì¶”ì¶œ


# William Gossetì˜ Ageë§Œ ì¶”ì¶œ (ë‘ ë²ˆì§¸ í–‰ì˜ 'Age' ì—´)
age = sci1.iloc[1]["Age"]
print(age)


# row: 1ë²ˆì§¸, col: 'Age'ëŠ” 4ë²ˆì§¸ ì—´ (0ë¶€í„° ì‹œì‘)
age = sci1.iloc[1, 4]
print(age)

61
61

In [23]:
#born, died ë§Œ ì¶”ì¶œ

print(sci1[["Born", "Died"]])

print(sci1.loc[:, ["Born", "Died"]])

print(sci1.iloc[:, [2, 3]])  # Born = 2, Died = 3ë²ˆì§¸ ì—´

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16
         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16
         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [24]:
#occupationë§Œ ì¶”ì¶œ

print(sci1["Occupation"])

print(sci1.loc[:, "Occupation"])

print(sci1.iloc[:, 1])

0         Chemist
1    Statistician
Name: Occupation, dtype: object
0         Chemist
1    Statistician
Name: Occupation, dtype: object
0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [25]:
sci1.to_csv('./data/scientist_1.csv')

In [26]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [27]:
# pickle : íŒŒì´ì¬ì˜ ê°ì²´í˜•ì„ ì €ì¥
sci1.to_pickle('./data/scientist.pickle')

In [28]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [29]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [30]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

# ë°ì´í„° ë¯¸ë¦¬ë³´ê¸°

## ë°ì´í„°í”„ë ˆì„ ì‚¬ìš©

**ë¯¸ë¦¬ë³´ê¸° ê¸°ëŠ¥ :** ë°ì´í„°í”„ë ˆì„ì—ì„œ ë¨¼ì € ë°ì´í„°ì˜ êµ¬ì¡°ì™€ ë‚´ìš©ì„ ë¹ ë¥´ê²Œ íŒŒì•…í•˜ê¸° ìœ„í•œ ê¸°ëŠ¥

- head(): ë°ì´í„°í”„ë ˆì„ì˜ ì²˜ìŒ 5ê°œ í–‰ì„ ë³´ì—¬ì¤€ë‹¤ (ë§¤ê°œë³€ìˆ˜ë¡œ ë‹¤ë¥¸ ìˆ«ì ì§€ì • ê°€ëŠ¥)
- tail(): ë°ì´í„°í”„ë ˆì„ì˜ ë§ˆì§€ë§‰ 5ê°œ í–‰ì„ ë³´ì—¬ì¤€ë‹¤
- info(): ë°ì´í„°í”„ë ˆì„ì˜ ê¸°ë³¸ ì •ë³´ (í–‰/ì—´ ê°œìˆ˜, ë°ì´í„° íƒ€ì…, ë©”ëª¨ë¦¬ ì‚¬ìš©ëŸ‰ ë“±)ë¥¼ í‘œì‹œ
- describe(): ìˆ˜ì¹˜í˜• ì—´ì— ëŒ€í•œ ìš”ì•½ í†µê³„ëŸ‰ (í‰ê· , í‘œì¤€í¸ì°¨, ìµœì†Œ/ìµœëŒ€ê°’ ë“±)ì„ ê³„ì‚°

In [31]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [32]:
df1.head(3) #default=5

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [33]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [34]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [36]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [37]:
df1.loc[:,'Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [38]:
data = {
    'ì´ë¦„': ['ê¹€ì² ìˆ˜', 'ì´ì˜í¬', 'ë°•ë¯¼ìˆ˜', 'ì •ìˆ˜ì§„', 'ìµœì˜í˜¸', 'í•œë¯¸ë˜', 'ìœ¤ì§€ì›'],
    'ë‚˜ì´': [25, 28, 22, 31, 27, 24, 29],
    'ì ìˆ˜': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    ì´ë¦„  ë‚˜ì´  ì ìˆ˜
0  ê¹€ì² ìˆ˜  25  85
1  ì´ì˜í¬  28  92
2  ë°•ë¯¼ìˆ˜  22  78
3  ì •ìˆ˜ì§„  31  95
4  ìµœì˜í˜¸  27  88
5  í•œë¯¸ë˜  24  73
6  ìœ¤ì§€ì›  29  91

In [39]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [40]:
df.columns

Index(['ì´ë¦„', 'ë‚˜ì´', 'ì ìˆ˜'], dtype='object')

In [41]:
df.columns = ['name', 'age', 'score']

In [42]:
df

  name  age  score
0  ê¹€ì² ìˆ˜   25     85
1  ì´ì˜í¬   28     92
2  ë°•ë¯¼ìˆ˜   22     78
3  ì •ìˆ˜ì§„   31     95
4  ìµœì˜í˜¸   27     88
5  í•œë¯¸ë˜   24     73
6  ìœ¤ì§€ì›   29     91

In [43]:
df.shape

(7, 3)

In [44]:
df.values

array([['ê¹€ì² ìˆ˜', 25, 85],
       ['ì´ì˜í¬', 28, 92],
       ['ë°•ë¯¼ìˆ˜', 22, 78],
       ['ì •ìˆ˜ì§„', 31, 95],
       ['ìµœì˜í˜¸', 27, 88],
       ['í•œë¯¸ë˜', 24, 73],
       ['ìœ¤ì§€ì›', 29, 91]], dtype=object)

## **ë°ì´í„°í”„ë ˆì„ì˜ ì†ì„±**

- index: í–‰ ì´ë¦„(ì¸ë±ìŠ¤)ì„ ë³´ì—¬ì£¼ëŠ” ì†ì„±
- columns: ì—´ ì´ë¦„ì„ ë³´ì—¬ì£¼ëŠ” ì†ì„±

```python
print(df.index)    # í–‰ ì´ë¦„ ì¶œë ¥
print(df.columns)  # ì—´ ì´ë¦„ ì¶œë ¥
```

- shape : í–‰ê³¼ ì—´ í¬ê¸°ë¥¼ ë³´ì—¬ì£¼ëŠ” ì†ì„±
- values : values ì†ì„±ì„ ì‚¬ìš©í•˜ì—¬ ê°’ í™•ì¸ ê°€ëŠ¥

**í–‰ê³¼ ì—´ ì´ë¦„ ë°”ê¾¸ê¸°**

ë°ì´í„°í”„ë ˆì„ì˜ í–‰ê³¼ ì—´ ì´ë¦„ì€ í•„ìš”ì— ë”°ë¼ ë³€ê²½í•  ìˆ˜ ìˆë‹¤. 

```python
# í–‰ ì´ë¦„ ë³€ê²½
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
print(df.index)

# columns ì†ì„±ìœ¼ë¡œ ëª¨ë“  ì—´ ì´ë¦„ í•œë²ˆì— ë³€ê²½
df.columns = ['name', 'age', 'score']

# ì—´ ìˆœì„œëŠ” ê·¸ëŒ€ë¡œ ìœ ì§€ë˜ë©°, ìƒˆë¡œìš´ ì´ë¦„ì´ ìˆœì„œëŒ€ë¡œ ì ìš©ë¨
print(df.columns)
```

- ê¸°ì¡´ ì—´ì˜ ê°œìˆ˜ì™€ ìƒˆë¡œìš´ ì´ë¦„ì˜ ê°œìˆ˜ê°€ ì •í™•íˆ ì¼ì¹˜í•˜ëŠ” ëª©ë¡ì„ ì œì‹œ â†’  ëª¨ë“  ì—´ ì´ë¦„ì´ í•œ ë²ˆì— ë³€ê²½ë¨
- ì—´ ì´ë¦„ì€ ë¬¸ìì—´ì´ë‚˜ ìˆ«ìë¡œ ì§€ì • ê°€ëŠ¥í•˜ê³ , ì¤‘ë³µëœ ì—´ ì´ë¦„ì€ í”¼í•˜ëŠ” ê²ƒì´ ì¢‹ìŒ

## ë°ì´í„°í”„ë ˆì„ì˜ ë©”ì†Œë“œ

### **í–‰ê³¼ ì—´ì˜ ì¼ë¶€ë§Œ ë°”ê¾¸ê¸°**

rename() ë©”ì„œë“œ : ë”•ì…”ë„ˆë¦¬ë¥¼ ì‚¬ìš©í•˜ì—¬  íŠ¹ì • ì—´ê³¼ í–‰ì˜ ì´ë¦„ì„ ë³€ê²½í•œë‹¤.  

ì—´/í–‰ ëª©ë¡ì—ëŠ” ê¸°ì¡´ ì—´ ì´ë¦„ê³¼ ìƒˆë¡œìš´ ì—´ ì´ë¦„ì„ ë§¤í•‘í•´ì„œ ì‘ì„±í•œë‹¤.

inplace=True ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ë©´ ì›ë³¸ ë°ì´í„°í”„ë ˆì„ì„ ì§ì ‘ ìˆ˜ì •í•  ìˆ˜ ìˆë‹¤.

```python
# ì—´ ì´ë¦„ ë³€ê²½
df.rename(columns={'ì´ë¦„': 'name', 'ë‚˜ì´': 'age', 'ì ìˆ˜': 'score'})
df.rename(index={"A":"a", "B": "b"})
df
```

### **ì¸ë±ì‹±ê³¼ ìŠ¬ë¼ì´ì‹±**

<aside>
ğŸ’¡

[ ]: ì¸ë±ìŠ¤  í‘œì‹œ

loc[ ] ì™€ iloc[ ] : ë¼ë²¨ ê¸°ë°˜, í–‰ë²ˆí˜¸ ê¸°ë°˜

loc[ ì¸ë±ìŠ¤ëª…, ì»¬ëŸ¼ëª…]

iloc[í–‰ë²ˆí˜¸, ì—´ë²ˆí˜¸]

</aside>

**ì¸ë±ì‹±**

```python
#ì—´ ì„ íƒ > ì‹œë¦¬ì¦ˆ ì¶”ì¶œ
print(df['ì´ë¦„'])

# ilocë¡œ ìœ„ì¹˜ ê¸°ë°˜ í–‰ ì„ íƒ
print(df.iloc[0])     # ì²« ë²ˆì§¸ í–‰
print(df.iloc[1:4])   # 2~4ë²ˆì§¸ í–‰

# locë¡œ ë¼ë²¨ ê¸°ë°˜ í–‰ ì„ íƒ
print(df.loc['A'])    # ì¸ë±ìŠ¤ê°€ 'A'ì¸ í–‰

# ì¡°ê±´ì„ ì‚¬ìš©í•œ í–‰ ì„ íƒ
print(df[df['age'] > 25])  # ë‚˜ì´ê°€ 25ë³´ë‹¤ í° í–‰ë“¤
```

**ìŠ¬ë¼ì´ì‹±**

<aside>
ğŸ’¡

loc[ì‹œì‘ ì¸ë±ìŠ¤ëª… : ë ì¸ë±ìŠ¤ëª…, ì‹œì‘ ì»¬ëŸ¼ëª… : ë ì»¬ëŸ¼ëª…]

iloc[ì‹œì‘ í–‰ë²ˆí˜¸ : ë í–‰ë²ˆí˜¸, ì‹œì‘ ì—´ë²ˆí˜¸ : ë ì—´ë²ˆí˜¸]

</aside>

**ë¶ˆë¦¬ì–¸ ì¸ë±ì‹± (í•„í„°ë§)**

<aside>
ğŸ’¡

[ ì¡°ê±´ ]

[ (ì¡°ê±´1) [&,I]  (ì¡°ê±´2) ]

</aside>

In [45]:
df.iloc[0:2] # í–‰ë‹¨ìœ„ ìŠ¬ë¼ì´ì‹± -1

  name  age  score
0  ê¹€ì² ìˆ˜   25     85
1  ì´ì˜í¬   28     92

In [46]:
df.loc[0] #í–‰ë‹¨ìœ„ëŠ” iloc, ì´ë¦„ë‹¨ìœ„ loc

name     ê¹€ì² ìˆ˜
age       25
score     85
Name: 0, dtype: object

In [47]:
import pandas as pd

data = {
    'ì´ë¦„': ['ê¹€ì² ìˆ˜', 'ì´ì˜í¬', 'ë°•ë¯¼ìˆ˜', 'ì •ìˆ˜ì§„', 'ìµœì˜í˜¸', 'í•œë¯¸ë˜', 'ìœ¤ì§€ì›'],
    'ë‚˜ì´': [25, 28, 22, 31, 27, 24, 29],
    'ì ìˆ˜': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

# ì ìˆ˜ > 90ì¸ í–‰ ì¶”ì¶œ

high_score_df = df[df["ì ìˆ˜"] > 90]
print(high_score_df)

    ì´ë¦„  ë‚˜ì´  ì ìˆ˜
1  ì´ì˜í¬  28  92
3  ì •ìˆ˜ì§„  31  95
6  ìœ¤ì§€ì›  29  91

In [48]:
df.loc[7] = ['í™ê¸¸ë™', 30, 70]
# ìƒˆë¡œìš´ í–‰ ì¶”ê°€ > loc[]í–‰ ì¶”ê°€
# df.iloc[8] = ['ê¹€ê¸¸ë™', 20, 99]

# í–‰ ì¶”ê°€ì™€ ì—´ ì¶”ê°€

loc[] ì¸ë±ì„œë¥¼ ì‚¬ìš©í•˜ê±°ë‚˜ append() ë©”ì„œë“œë¥¼ ì‚¬ìš©í•˜ì—¬ ìƒˆë¡œìš´ í–‰ì„ ì¶”ê°€í•  ìˆ˜ ìˆë‹¤. 

concat() í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ì—¬ëŸ¬ ë°ì´í„°í”„ë ˆì„ì„ ê²°í•©í•˜ëŠ” ë°©ì‹ìœ¼ë¡œë„ í–‰ì„ ì¶”ê°€í•  ìˆ˜ ìˆë‹¤.

In [49]:
import pandas as pd

# ê¸°ì¡´ DataFrame
data = {
    'name': ['ê¹€ì² ìˆ˜', 'ì´ì˜í¬', 'ë°•ë¯¼ìˆ˜'],
    'age': [25, 28, 22],
    'score': [85, 92, 78]
}
df = pd.DataFrame(data)

# ìƒˆ í–‰ ë§Œë“¤ê¸°
new_row = pd.DataFrame([['ê¹€ì§€ìˆ˜', 23, 95]], columns=['name', 'age', 'score'])

# concatìœ¼ë¡œ í–‰ ì¶”ê°€
df = pd.concat([df, new_row], ignore_index=True)

print(df)

  name  age  score
0  ê¹€ì² ìˆ˜   25     85
1  ì´ì˜í¬   28     92
2  ë°•ë¯¼ìˆ˜   22     78
3  ê¹€ì§€ìˆ˜   23     95

In [50]:
# grade ì—´ ì¶”ê°€
df['grade'] = ['A', 'B', 'A', 'C']

# student_id ì—´ì´ ì´ë¯¸ ìˆë‹¤ë©´ ë¨¼ì € ì‚­ì œ
if 'student_id' in df.columns:
    df.drop(columns='student_id', inplace=True)

# ê·¸ëŸ° ë‹¤ìŒ insertë¡œ ì¶”ê°€
df.insert(loc=1, column='student_id', value=['S001', 'S002', 'S003', 'S004'])

print(df)  # â† ê²°ê³¼ê°€ ë¬´ì¡°ê±´ ì¶œë ¥ë¼

  name student_id  age  score grade
0  ê¹€ì² ìˆ˜       S001   25     85     A
1  ì´ì˜í¬       S002   28     92     B
2  ë°•ë¯¼ìˆ˜       S003   22     78     A
3  ê¹€ì§€ìˆ˜       S004   23     95     C

# í–‰ ì‚­ì œì™€ ì—´ ì‚­ì œ

drop() ë©”ì„œë“œë¥¼ ì‚¬ìš©í•˜ê³ , axis=0 ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ í–‰ì„ ì‚­ì œí•œë‹¤.

inplace=Trueë¥¼ ì„¤ì •í•˜ë©´ ì›ë³¸ ë°ì´í„°í”„ë ˆì„ì„ ì§ì ‘ ìˆ˜ì •í•  ìˆ˜ ìˆë‹¤.

In [51]:
df.drop(columns=df.columns[4])

  name student_id  age  score
0  ê¹€ì² ìˆ˜       S001   25     85
1  ì´ì˜í¬       S002   28     92
2  ë°•ë¯¼ìˆ˜       S003   22     78
3  ê¹€ì§€ìˆ˜       S004   23     95